[{
  "name": "Prof. Aminata Sillah, PhD",
  "position": "Principal Advisor to the Board",
  "bio": "Aminata Sillah, PhD is an educator, entrepreneur, international development analyst, experienced nonprofit manager and urban policy analyst, who helps leaders and passionate entrepreneurs ensure positive impact around the world. She combines her expertise and experience in non-profit management, education, youth development, public management and international development to help nonprofits, local governments and private institutions from a variety of vantage points ( board chairs, CEOs, consultants, founders, incubators, and volunteer managers) to improve service quality and strengthen institutional capacities through training, education, and strategic planning. She is the current CEO of Global Youth Innovation Network, a network for youth entrepreneurs and rural micro - enterprises who are committed to act as hunger fighters, change agents, and innovators, globally.Aminata is the Co - founder of Krysalis Global Solutions(KGS), a capacity building organization that assist organizations transform into high impact organizations by focusing on their needs.Dr.Sillah is an avid promoter of Youth development and a Mentor for entrepreneurs at the Tony Elumelu Foundation.She has served as a Grader for the Mandela Washington Fellowship– Youth African Leadership Initiative(YALI) and as a subject matter expertfor the World Bank Youth Summit.She is a co - founder of the Section on African Public Administration(SAPA) at the American Society of Public Administration(ASPA), which brings global scholars and practitioners together with a passion and commitment to advance public administration on the African continent. She currently serves on the board of several nonprofits including Interdisciplinary Action Research Center www.iarc - us.com; and is the current President of Jurarim Organization for Youth Excellence - JOYE(Allen, Texas).She holds a Master of Public Administration(MPA) in Urban Government and a PhD in Public Administration and Management.Dr.Sillah is Assistant Professor of Political Science at Towson University and an Adjunct lecturer in the school of Business and Public Administration, University of The Gambia.",
  "id": 1,
  "url": "./img/animata_sillah.jpg"
},
{
  "name": "Ansumana Darboe, PhD",
  "position": "President",
  "bio": "Ansumana Darboe, a former president of the University of the Gambia students’ union (2008/2009), is currently pursuing a PhD degree in Higher Education Administration and Leadership at the University of Illinois, USA. He obtained an undergraduate degree from the University of The Gambia in 2010 and worked in the Office of University Relations of that same institution for many years; first as an Administrative Assistant, and later (2012) as an Administrative Officer in charge of university collaborations, partnerships and public relations. He moved to the US in 2011 for a master’s degree program in Public Administration at the University of Illinois, Springfield, where he currently resides.",
  "id": 2,
  "url": "./img/ansumana_darboe.jpg"
},
{
  "name": "Isatou Bittaye, MA",
  "position": "Vice President",
  "bio": "Isatou Bittaye is a Development and Communications professional with almost a decade of experience in Non-profit work and public service focusing on fundraising, communications & advocacy, and project management. She is based in New Jersey and currently works at the Population Council as Foundation Coordinator, leading the growth of the Council’s revenue from small to mid-size and family foundations in the U.S. and internationally. She previously served as a Development Assistant at the National Network for Safe Communities, an action research center at John Jay College of Criminal Justice that works with cities to reduce violence and ensuring safe communities. Over the years, Isatou’ s work centers on girls and young women, advocating for their rights and developing their skills and leadership abilities around issues that mostly affect their lives.She has held roles with various women’ s advocacy organizations in New York City including Women Deliver, Ms.Foundation for Women and the YWCA of the City of New York. Prior to immigrating to the U.S., she worked as a Senior Program Officer at the National Council for Civic Education of The Gambia for five years where she acted as the organization’ s project grant writer and program lead, which helped her educate Gambian citizens about their human rights while simultaneously helping to promote civic education in the country.She has also volunteered as a Communications Manager of The Girls’ Agenda– a young women - led organization in The Gambia that empowers girls and young women, and advocates for the respect and protection of their human rights.She is a member of the Peace Ambassadors– The Gambia(a peace education and advocacy organization), and she has also previously served in the National Executive Committee of the organization. Isatou graduated from the University of The Gambia(UTG) in 2011 with a BSc.in Political Science and Development Studies.While at the UTG she served as the Information and Public Relations Officer(IPRO) of the University of The Gambia Students’ Council from 2008 - 2009, and it was during her tenure that the first students’ newsletter - The Podium was initiated.She was also a Vice - President of the UTG Students’ Writers Association, and a member of the Social Sciences Students’ Association. She holds an M.A in International Studies from National Chengchi University in Taiwan and she is currently pursuing a second Master’ s in Women’ s and Gender Studies at The Graduate Center, City University of New York.Her love for volunteerism and service to community led to her election as a Program Representative in the Doctoral and Graduate Students’ Council(DSC) for the 2019 / 2020 academic year, and she served as the DSC Officer for Funding and Chairperson of the Grants Committee in the Fall 2019 semester. Isatou is a Women Deliver Young Leader in the class of 2016 and is part of 700 Global Young Leaders promoting the sexual and reproductive health rights of girls and women across the world.She is very passionate about advancing human rights, social justice and promoting community development.She strongly believes in meaningfully engaging the young people and amplifying their voices to build them the future they want.",
  "id": 3,
  "url": "./img/isatou_bittaye.jpg"

},
{
  "name": "Ebrima Tunkara, PhD",
  "position": "Chairman of the Board",
  "bio": "Ebrima is currently employed as a Process Engineer at Intel Corporation, OR. He was born and brought up in Farafenni, where he did all his elementary and Junior Secondary School education. He later moved to Nusrat Senior Secondary School to study Science, which he completed in 2006. He enrolled at the University of The Gambia as a freshman in 2006 to study Biology and Chemistry (double majors). While studying at the UTG, he served the main students' union on two occasions; Firstly, as an Assistant Sports Director 2007/8, and later as an Assistant Information and Public Relation Officer, 2008/9. He was also elected as the vice president of the Science Club of the UTG during the 2008-2009 academic year. At a national level (while still a student at the UTG), Ebrima was elected as the 2nd Vice President of the Gambia Volleyball Association (GVBA). Following graduation from the UTG in 2010, Ebrima was hired as a teaching assistant in the chemistry department of the UTG. He served two years of tutoring, mentoring, and helping instructors at the chemistry department to set up laboratories for students. In the fall of 2012, he benefitted from the Islamic Development Bank scholarship, which took him to Turkey for a two-years master's degree program in Analytical Chemistry at Bilkent University. He graduated from that program in June of 2014 and moved to the US two months afterward for a Ph.D. Program in Material/Analytical chemistry at The University of Tulsa, Oklahoma. Ebrima's main strengths are on; Synthesis and surface modification of plasmonic nanocrystals, designing nanofluid filters for solar filtering applications, and surfactant-directed synthesis of lyotropic liquid crystalline proton conductors and biomimetic materials. He loves playing soccer and taking part in youth/community development projects.",
  "id": 4,
  "url": "./img/ebrima_tunkara.jpg"
},
{
  "name": "Yamundow Camara, MSc",
  "position": "Technical Director",
  "bio": "After graduating from Nusrat Senior Secondary School in 2007, Yamundow earned a BSc in Computer Science and a Minor in Mathematics from the University of The Gambia in 2012. At the UTG, she served as a Minister of Information and Communications for the University of The Gambia Students’ Union and was also the first Vice President of the UTG Debate Association. In addition, she served as the Coordinator for the Give1project-all Girls Tech Camp, where she worked on empowering women/girls through technology by teaching them how to write code in different Programming languages and provided digital literacy for girls from different regions of The Gambia. She also served as a Country Coordinator for MOVAAR organization (Making our visions and aspirations reality), an organization that focuses on building the entrepreneurial skills of students through Education and mentorship programs. Following graduation, she worked as a Software Engineer and later a Technical Support Manager at InSIST Global, a software development firm.Few years later(2016), Yamundow was chosen as a Mandela Washington Fellow, under the Business and Entrepreneurship track at Northwestern University in Chicago Area to take part in President Obama 's Young African Leadership Initiative (YALI), a flagship program that brings together up to 1000 African student leaders for a 6 weeks program on academic course work, leadership training and networking at Universities in the United States. She received a master’ s degree in Information Systems at the University of Illinois Springfield(UIS), where she worked as a Graduate Research Assistant in Data Analyst.With her passion for leadership and development, she was elected as a Senator in the University of Illinois Student Government Organization, where she served as the only African student Senator, yet again proving that women can do it too regardless of their background.In 2017, while still studying at UIS, she received a scholarship from Microsoft to attend the Grace Hopper celebration of women in computing in Orlando, Florida.She was also a recipient of the world bank group youth summit, Washington DC 2017. She served as the Director of Information Systems for the Society of Human Resource(SHRM) Students Chapter at the university of Illinois.She also served as a technical judge at Saint Louis University Hackathon competition, Missouri 2018. Yamundow currently works as Computer Programmer Analyst at the Centers for Disease control and prevention CDC Atlanta, Genomics and Diagnosis - National Center for Immunization & Respiratory Disease(NCIRD), Infectious Disease(ID) Diagnostic & Surveillance Development Team(Influenza).",
  "id": 6,
  "url": "./img/yamundow_camara.jpg"
},
{
  "name": "Alhagie Bai Cham, BEE",
  "position": "Assistant Technical Director",
  "bio": "Alhagie Bai Cham graduated with a BSc degree in Mathematics and Economics from the University of The Gambia in June 2010. He then immigrated to the US in September 2010 and worked in the health sector for a few years while going to school fulltime at the University of Washington. During his tenure at the University of Washington, he conducted a research on cochlear implants devices, built a filter that increases the signal-to-noise ratio in such devices, and presented his research at the Mary Gate's Research Foundation in May 2018. The following month, June 2018, he graduated with a BSc in Electrical engineering with Honors. He later embarked on studying Software Engineering (mostly self-taught). He worked for a couple of months as a Data Analyst at Boeing in Seattle and as a Java Developer at jetBlue airways in NYC. He now works and now works as Software Engineer at Mphasis in Wilmington Deleware. Some of Alhagie's interests are on health, fitness, and phychology. He reads about extensively, works out regularly, and loves hanging out with his family and friends. He also goes by the name ABC.",
  "id": 7,
  "url": "./img/alhagie_bai.jpg"
},
{
  "name": "Lamin Sanyang, BSc, RN",
  "position": "Directors of Logistics",
  "bio": "Lamin Sanyang attended Gambia Senior Secondary School from 2001 to 2004. In January 2005, he was admitted at the Gambia College, School of Public Health where he completed a Higher National Diploma in Public & Environmental Health in July 2007. Furthermore, Lamin completed a Diploma in Banking and Finance from the Management Development Institute in January 2009. In September 2009, he gained admission at the University of the Gambia for a BSc. Degree in Public and Environmental Health. Lamin just recently (2019) bagged a Nursing degree at Cuyahoga Community College, Cleveland, and he is now a graduate degree student (master’s) in Environmental and Occupational Health Sciences at Western Kentucky University, Bowling Green, Kentucky. In terms of work experience, Lamin worked as a grassroot Public and Environmental Health Officer with the Ministry of Health and Social welfare from August 2007 to July 2012. From August 2012 to February 2014, he worked as a Senior Program Officer and Deputy Program Manager for the Non - Communicable Diseases Prevention and Control Unit of the Directorate of Health Promotion and Education, Ministry of Health and Social Welfare.In the US, Lamin worked for various Hospitals as a clinical technician. Outside of academic and professional life, Lamin is a youth activist who served numerous civil society organizations in various capacities including the Gambia College and the University of the Gambia Students’ Unions.Lamin served as the national President of Peace Ambassadors the Gambia, a peace education and advocacy organization with branches in Senegal and Casamance, from February 2010 to February 2014. The hallmark of Lamin’ s peace advocacy work took him to Ziguinchor in 2005 for a meeting with the former leader of the MFDC rebel group, the late Father Jamakung Senghore on how to bring peace in southern Senegal.Lamin also served as a trainer in leadership for many local and national youth organizations.",
  "id": 8,
  "url": "./img/lamin_sanyang.jpg"
},
{
  "name": "Bamba Njie, MPH",
  "position": "Assistant Direcotor of Logistics",
  "bio": "Mr. Bamba Njie is a Public Health Sanitarian with the City of San Antonio Metropolitan Health District. He regulates and permits food and drink establishments and investigates food-borne illnesses amongst other things. He received a Master of Public Health degree from the University of Illinois in Springfield (UIS) in 2014, where he worked as a graduate assistant. Prior to UIS, Mr.Njie served as administrative assistant at the University of The Gambia(UTG) department of public health for two years.He received a Bachelor of Science degree in Public and Environmental Health at the same institution in 2011. While at the University of The Gambia, Mr.Njie taught introductory public health courses at Gambia College School of Public Health, coordinated the post graduate diploma in population and gender development, and contributed to the formation of the UTG partnership with the University of Iowa, University of Illinois at Springfield and Drexel University in Pennsylvania. He served as onsite coordinator for student summer internship for the three U.S.universities during which he placed and mentored students with government and non - governmental institutions for experiential learning. Mr.Njie’ s public health career started off with a Higher National Diploma in Environmental Health, which he earned from The Gambia College School of Public Health in 2005. He is currently pursuing a degree in Network and Cloud Architecture at the Alamo Colleges District in San Antonio, Texas.",
  "id": 9,
  "url": "./img/bamba_njie.jpg"
},
{
  "name": "Baboucarr Drammer, LL.B, BL, LL.M",
  "position": "Directors of Communications",
  "bio": "Bubacarr Drammeh Esq. obtained a Master's degree (LL.M) in Sustainable International Development Law from the University of Washington, Seattle, USA. He was awarded the Roy Prosterman Leadership Award for the Sustainable International Development LLM Program and was the Graduate student commencement speaker, University of Washington Class of 2020.He obtained a Law degree(LLB) from the University of The Gambia.As a student, he represented the University of the Gambia in various moot court competition held around the globe and served as the Secretary - General of the University of The Gambia Law Students’ Association and the Liaison Officer of the University of The Gambia Law Clinic.He was called to the Bar in 2014 and was enrolled as a legal practitioner in The Gambia 2015. He worked at the Attorney General’ s Chamber and Ministry of Justice in The Gambia as a State Attorney.Prior to being a lawyer, he was a teacher at an elementary school(Bakoteh Annex Lower Basic School).In addition to being an Attorney, he is a youth leader, an advocate, and a motivational speaker.",
  "id": 10,
  "url": "./img/baboucarr_drammeh.jpg"
},
{
  "name": "Saikou Omar Saidy, MD",
  "position": "Program Coordinator",
  "bio": "Dr. Saikou Omar Saidy completed high school from St. Peters Technical Senior Secondary School in 2008. He then enrolled at the School of Medicine and Allied Health Sciences, University of the Gambia where he graduated with a Bachelor of Medicine & Bachelor of Surgery (MBChB) in May 2016. During his final year in medical school, Dr Saidy completed his clinical elective rotation at Morriston and Singleton Hospitals, University of Swansea, United Kingdom.He also served the National Officer for Research Exchange(NORE) at the International Federation of Medical Students ' Association ( IFMSA). In addition, Dr. Saidy served as the Country Director for Your Change For a Change (YCFaC), a 501(c)3 non-profit organization, which aims to make available quality and responsive disease preventive incentives and humanitarian support for communities. After graduating from medical school, Dr.Saidy worked as a house officer at the Edward Francis Small Teaching Hospital(EFSTH) in Banjul, The Gambia for one year.He then moved to the United States to pursue graduate medical education.Dr Saidy is Certified by the Educational Commission for Foreign Medical Graduates(ECFMG) and is currently doing an Internal Medicine residency program at Stanford Hospital, Columbia University Vagelos College of Physicians & Surgeons in Stamford Connecticut. Dr.Saidy is personate about community service, health promotion and disease prevention.He is gender equity and human right activist and a reproductive health educator.",
  "id": 11,
  "url": "./img/saikou_omar.jpg"
},

{
  "name": "Malick Sarr, MAcc",
  "position": "Finance Director",
  "bio": "Malick Sarr graduated from Nusrat Senior Secondary School in 2009. He Enrolled at the University of The Gambia’s Accountancy Program and graduated with a Bachelor’s in Accountancy in 2013. Upon graduation, Malick worked for the Network Against Gender Based Violence as a Finance and Admin Officer and was later promoted as a Finance & Administrative Manager for Actionaid-AmplifyChange project on gender-based violence (GBV) for a total of 5years. In 2018, Malick enrolled at the University of Illinois at Springfield to pursue a master’ s degree in Accounting while working at the Illinois Department of Correction as a Budget and Finance officer through GPSI(Graduate Public Service Internship Program). Malick is passionate about community service and Non - Profit organization work; he served as an IRS Volunteer Income Tax Assistant for Spring of 2019 tax season and he currently works as an Accountant at Disability Rights of Wisconsin(DRW).",
  "id": 13,
  "url": "./img/malick_sarr.jpg"
},
{
  "name": "Ebrima Gomez, MSc, MBA",
  "position": "Assistant Finance Director",
  "bio": "Ebrima is a Financial Analyst with Sphere Payments, a payment processing company located in Irving, Texas. He works with the financial team to construct deals, build financial models, monitor compensation plans, and analyze sales trends. Ebrima grew up in Albreda village, where he attended primary and junior education and later moved to Nusrat Senior Secondary School in Bundung, 2003 - 2006. In 2008, Ebrima enrolled at the University of the Gambia and received a BSc.(Hons) in Economics and Finance in 2012. Upon graduation, Ebrima worked at Access Bank as a Financial Analyst, and later with the University of the Gambia as a Graduate Assistant. Two years later, Ebrima was awarded a Turkiye Burslari Scholarship to pursue a master’ s degree program in Economics at Anadolu University in Turkey.He completed this program with an additional diploma in Turkish and Azerbaijani languages.A semester before completing the MSc program, Ebrima also enrolled in an MBA program at the University of Illinois at Springfield and worked with the College of Business and Management as a Data Analyst.In addition to having a master’ s degree in Business Administration, Ebrima also received Graduate Certificates in Entrepreneurship and Business Analytics / Data Mining.He is a lifetime member of the Beta Gamma Sigma society, a recognition for being amongst the top 10 % of graduate students in AACSB accredited business schools around the globe. Ebrima has special interest in using data analytics to create business - winning strategies.He is passionate about applying lean concepts in startup businesses and loves to help startup firms apply such concepts.He is an active member of Innovate Springfield, a startup incubator and was one of the organizers of the first Illinois Capital Innovation Awards.He is passionate about using entrepreneurship to alleviate poverty.",
  "id": 14,
  "url": "./img/ebrima_gomez.jpg"
},

{
  "name": "Ansuma Ceesay, MA",
  "position": "Directors of Admin and Operations",
  "bio": "Ansumana Ceesay completed the Higher Teachers’ Certificate (HTC) from The Gambia College in 2004 and a bachelor’s degree from the UTG in 2010. Upon graduation from the UTG, Mr. Ceesay got hired by the Public Service Commission and posted at the National Population Commission Secretariat (NPCS) in September 2010. At NPCS, he first started as the Information, Education and Communication (IEC) Officer and rose through the ranks to become the Acting Deputy Director of Population Affairs. Mr.Ceesay also obtained a Master of Philosophy Degree(Mphil) in Demography from the Cairo Demography Centre In Egypt.He currently lives in Louisville and is pursuing a master’ s of Science Degree in Healthcare Administration at the Purdue University Global, Indiana.",
  "id": 16,
  "url": "./img/ansumana_ceesay.jpg"
},
{
  "name": "Samba Bah, PhD Candidate",
  "position": "Asst Directors of Admin and Operations",
  "bio": "Samba Bah is a Doctoral Student of Higher Education Leadership and Administration at the Patton College of Education, Ohio University. He has a MA in International Development from the Center for International Studies at Ohio University, a master’s in African History and a bachelor’s degree in Political Science from the University of The Gambia. Samba’s previous engagements include teaching at the University of The Gambia and working in the non-profit and youth development sector in The Gambia, where he served as a speaker of the National Youth Parliament from September 2013 to August 2016.",
  "id": 17,
  "url": "./img/samba_bah.jpg"
},
{
  "name": "Lamin Jatta, MA",
  "position": "Board Member",
  "bio": "Placeholder text Nisi aliqua dolor pariatur nisi ut dolore proident cillum. Duis dolore deserunt labore dolor veniam irure excepteur ex. Tempor labore ad tempor exercitation dolore enim.",
  "id": 18,
  "url": "./img/lamin_sanyang.jpg"
},
{
  "name": "Ousman Jobe, BSc, RN",
  "position": "Board Member",
  "bio": "Ousman Jobe is a registered nurse (RN) in Austin, TX. He attended Gambia High School from 2000-2003 and later worked as a Savings and Credit Assistant Officer with Gamsavings. Following his employing with Gamsavings, he studied economics and management from the University of The Gambia (2006-2010) before Immigrating to the US in 2011. Since then, he had obtained a Registered Nurse (RN) degree from Tyler Juniors College (Texas) and currently works as a Pediatric Nurse. He has a passion for community service and youth development.",
  "id": 19,
  "url": "./img/ousman_jobe.jpg"
},
{
  "name": "Hamidou Jallow, MSE",
  "position": "Board Member",
  "bio": "Hamidou graduated from Gambia Senior Secondary School in 2006. He spent three (3) years at the University of The Gambia Medical School before changing his field to engineering. He obtained a bachelor’s degree in Chemical/Process Engineering from Putra University of Malaysia in 2013. After graduation, he returned to the Gambia and worked as a Further Math & Physics Teacher at his former high school and a chemistry Teaching Assistant (TA) at the UTG between 2013 and 2014. In 2015, Hamidou obtained a master’s degree in Industrial Engineering Technology. Since then, he has worked in Product Design and Development, Product Management, Quality Engineering and Process Improvement. He currently works as a Quality Engineering and Process Improvement Specialist at Icicle Seafoods. Hamidou loves community activities and he is always interested in giving back to communities. He has special interest in religious studies, teaching, entrepreneurship, and football.",
  "id": 20,
  "url": "./img/hamidou_jallow.jpg"
},
{
  "name": "Suwaibou Saidy, BAcc",
  "position": "Board Member",
  "bio": "Suwaibou Saidy graduated from Nusrat Senior Secondary School in 2006 and enrolled in the University of The Gambia in 2009. He graduated in 2013 with a bachelor’s degree in accountancy. He worked in the banking sector for two years starting in 2012 where he served as an Internal Auditor and then a Financial Control Officer before resigning in 2014. He then worked for Africmed Clinic as a Senior Accountant for about Six months before traveling to the United States in 2015 for his graduate studies. With a passion in Audit and Fraud Investigation, he enrolled in Southern New Hampshire University for a master’s degree in forensic accounting. Alongside being a part time graduate student, Suwaibou worked as a data entry clerk for a year in a wellness company and then a Billing specialist in Accounts Receivables in a Marketing company for a year as well. He is currently working as an Internal Auditor for a Refrigeration company whiles pursuing his master’s program. Suwaibou has a strong passion for curbing Financial crimes and embezzlement and intends to use his knowledge and skills as a Forensic Accountant to help his country fight against corruption and embezzlement of public funds. Suwaibou outside of his career is very interested in Spirituality and studying religious text, different cultures and lifestyles, religious poetry and storytelling.",
  "id": 21,
  "url": "./img/suwaidou_saidy.jpg"
},
{
  "name": "Mariama Ceesay, MD",
  "position": "Not given",
  "bio": "Dr. Mariama Ceesay is currently a resident physician in Obstetrics and Gynecology at the University of Texas at Austin. She graduated from the UTG with a BSc in Chemistry in 2010 and later worked on a Malaria Project at the Medical Research Council before moving to the US in late 2010. Mariama completed a post Baccalaureate degree from the University of Texas at Dallas (UTD) and graduated with magna cum laude and major honors in Biology. While obtaining her Degree from UTD, she worked full time as a patient care technician and later as a telemetry technician at Methodist Charlton medical center, Emergency Department in Dallas Texas. In 2015, Dr. Ceesay moved to Wisconsin to complete a Doctor of Medicine degree from the Medical college of Wisconsin, which she completed in 2019.",
  "id": 22,
  "url": "./img/mariama_ceesay.jpg"
}
]